//--------------------------------------------------------------------------------------------------
//= Setting
//--------------------------------------------------------------------------------------------------
class Setting
{
	//----------------------------------------------------------------------------------------------
	//= 設定画面を開く
	//----------------------------------------------------------------------------------------------
	static Open()
	{
		// メニューバーの 設定 > コメントを読み上げる をクリックできなくする
		MenuBar.CallBouyomiChanButton.enabled = false;

		// メニューバーの 設定 > 設定 をクリックできなくする
		MenuBar.SettingButton.enabled = false;

		// 画面に影をかける
		$('#Shade').addClass('Show');

		// 設定画面を表示させる
		$('#Setting').load('./setting.html');
		$('#Setting').addClass('Show');
	}

	//----------------------------------------------------------------------------------------------
	//= 設定画面を閉じる
	//----------------------------------------------------------------------------------------------
	static Close()
	{
		// メニューバーの 設定 > コメントを読み上げる をクリックできるようにする
		MenuBar.CallBouyomiChanButton.enabled = true;

		// メニューバーの 設定 > 設定 をクリックできるようにする
		MenuBar.SettingButton.enabled = true;

		// 画面の影を取り払う
		$('#Shade').removeClass('Show');

		// 設定画面を非表示にする
		$('#Setting').empty();
		$('#Setting').removeClass('Show');
	}

	//----------------------------------------------------------------------------------------------
	//= 設定を保存する
	//----------------------------------------------------------------------------------------------
	static Save()
	{

	}

	//----------------------------------------------------------------------------------------------
	//= 設定を読み込む
	//----------------------------------------------------------------------------------------------
	static Load()
	{
		
	}
}